from Tasks.tasks1.test import get_total_str
from Tasks.tasks2.test import convert_file_names


if __name__ == '__main__':

    technic = [('Ноутбук', 1500, 'Татьяна', '89002001020'),
               ('Смартфон', 500, 'Анна', '89202202325'),
               ('Проектор ', 300, 'Андрей', '89505205656'),
               ('Принтер', 750, 'Игорь', '89303303236'),
               ('Планшет', 2300, 'Игорь', '89303303236'),
               ('Смартфон', 1000, 'Андрей', '89505205656'),
               ('Ноутбук', 4800, 'Татьяна', '89002001020'),
               ('Наушники', 780, 'Марина', '89562002350'),
               ('Сканер', 550, 'Сергей', '89808564559'),
               ('Планшет', 1200, 'Анна', '89202202325'),
               ('Ноутбук', 1100, 'Игорь', '89303303236'),
               ('Смартфон', 3500, 'Татьяна', '89002001020')]
    print('\nЗадание1', get_total_str(technic), sep='\n')

    file_names = ['123', 'rtytr', 'rfgyvklm', 'trytryo', 'r']
    print('\nЗадание2', convert_file_names(file_names), sep='\n')
